//Урок 1 СЕЛЕКТОРЫ
$(document).ready(function(){

	//***************************************************
	//Базовые селекторы (#id, tagName, .class)
	//***************************************************
	$('p.lead').css('border', 'solid 3px red');  //p с классом .lead


	//***************************************************
	//Селекторы взаимодействия (parent, child, + ~ и т.д.)
	//***************************************************
	$('h2').parent().css('border', 'solid 3px red'); //Родительский для класса h2
	$('h2').parents().css('border', 'solid 3px red'); //Выбирает всех родителей
	$().children().css();
	$('.box').find('h2').css(); //Найдет h2 в классе .box
	$('h2').prev().css(); //Прыдудщие элемент тегу h2
	$('h2').next().css(); //Следующий элемент тегу h2
	$('h2').next('h3').css(); //Следующий элемент тегу h2

	//***************************************************
	//Простые фильтры (:first, :last, even - нечет., odd- чет., eq(1) и т.д.)
	//***************************************************
	$('p:last').css('border', 'solid 3px red');

	//***************************************************
	//Фильтры по содержимому (:has, :parent, :empty и т.д.)
	//***************************************************
	$('p:has(span)').css('border', 'solid 3px red');

	//***************************************************
	////Фильтры по атрибутам ([name ~= value] и т.д)
	//***************************************************
	$('a[href="google.com"]').css('border', 'solid 3px red');
	$('a[href^="http:"]').css('border', 'solid 3px red'); //начинаются
	$('a[href$=".com"]').css('border', 'solid 3px red'); //заканчиваются
	$('a[href*=".com"]').css('border', 'solid 3px red'); //содержат все
	$('a[href!="http://ya.ru"]').css('border', 'solid 3px red'); //начинаются



});